class Answer {
    public static void arrayOutOfBoundsException() {
        // Напишите свое решение ниже
        int[] arr = new int[5];
        System.out.println(arr[10]); // Выход за пределы массива
      
}

    public static void divisionByZero() {
        // Напишите свое решение ниже
        System.out.println(10/0);
}

    public static void numberFormatException() {
        // Напишите свое решение ниже
        String str = "w";
        int res = Integer.parseInt(str);
 }
}
